<a href="https://colab.research.google.com/github/yoojinlee-hub/Practice_python/blob/main/pandas%20%EA%B8%B0%EC%B4%88.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**DataFrame**<br>
표 형식의 데이터를 담는 자료형<br>
index가 숫자가 아닌 것도 저장가능<br>
데이터값도 다른 자료형이 가능<br>
numpy:같은 자료형

In [1]:
import pandas as pd
two_dimensional_list=[['dongwook',50,86],['sineui',89,31],['ikjoong',68,91],['yoonsoo',88,75]]

In [4]:
my_df=pd.DataFrame(two_dimensional_list,columns=['name','English','Math'],index=['a','b','c','d'])
my_df

       name  English  Math
a  dongwook       50    86
b    sineui       89    31
c   ikjoong       68    91
d   yoonsoo       88    75

In [3]:
type(my_df)

pandas.core.frame.DataFrame

In [5]:
my_df.columns

Index(['name', 'English', 'Math'], dtype='object')

In [6]:
my_df.dtypes

name       object
English     int64
Math        int64
dtype: object

같은 columns 안에서는 같은 자료형이여야 한다

In [9]:
import numpy as np
import pandas as pd

two_dimensional_list = [['dongwook', 50, 86], ['sineui', 89, 31], ['ikjoong', 68, 91], ['yoonsoo', 88, 75]]
two_dimensional_array = np.array(two_dimensional_list)
list_of_series = [
    pd.Series(['dongwook', 50, 86]), 
    pd.Series(['sineui', 89, 31]), 
    pd.Series(['ikjoong', 68, 91]), 
    pd.Series(['yoonsoo', 88, 75])
]

# 아래 셋은 모두 동일합니다
df1 = pd.DataFrame(two_dimensional_list)
df2 = pd.DataFrame(two_dimensional_array)
df3 = pd.DataFrame(list_of_series)
print(df1)

          0   1   2
0  dongwook  50  86
1    sineui  89  31
2   ikjoong  68  91
3   yoonsoo  88  75

In [10]:
import numpy as np
import pandas as pd

names = ['dongwook', 'sineui', 'ikjoong', 'yoonsoo']
english_scores = [50, 89, 68, 88]
math_scores = [86, 31, 91, 75]

dict1 = {
    'name': names, 
    'english_score': english_scores, 
    'math_score': math_scores
}

dict2 = {
    'name': np.array(names), 
    'english_score': np.array(english_scores), 
    'math_score': np.array(math_scores)
}

dict3 = {
    'name': pd.Series(names), 
    'english_score': pd.Series(english_scores), 
    'math_score': pd.Series(math_scores)
}


# 아래 셋은 모두 동일합니다
df1 = pd.DataFrame(dict1)
df2 = pd.DataFrame(dict2)
df3 = pd.DataFrame(dict3)

print(df1)

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75

In [11]:
import numpy as np
import pandas as pd

my_list = [
    {'name': 'dongwook', 'english_score': 50, 'math_score': 86},
    {'name': 'sineui', 'english_score': 89, 'math_score': 31},
    {'name': 'ikjoong', 'english_score': 68, 'math_score': 91},
    {'name': 'yoonsoo', 'english_score': 88, 'math_score': 75}
]

df = pd.DataFrame(my_list)
print(df)

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75

스타들의 생일은 언제?

In [12]:
import pandas as pd

# 코드를 작성하세요.
birthday = [['Taylor Swift','December 13, 1989','Singer-songwriter'],
            ['Aaron Sorkin','June 9, 1961','Screenwriter'],
            ['Harry Potter','July 31, 1980','Wizard'],
            ['Ji-Sung Park','February 25, 1981','Footballer'],
            ]
df=pd.DataFrame(birthday,columns=['name','birthday','occupation'])
# 정답 출력
df

           name           birthday         occupation
0  Taylor Swift  December 13, 1989  Singer-songwriter
1  Aaron Sorkin       June 9, 1961       Screenwriter
2  Harry Potter      July 31, 1980             Wizard
3  Ji-Sung Park  February 25, 1981         Footballer

pandas로 데이터 읽기

In [17]:
import pandas as pd
iphone_df=pd.read_csv('/content/drive/MyDrive/iphone.csv',index_col=0)
iphone_df

                      출시일  디스플레이  메모리     출시 버전 Face ID
iPhone 7       2016-09-16    4.7  2GB  iOS 10.0      No
iPhone 7 Plus  2016-09-16    5.5  3GB  iOS 10.0      No
iPhone 8       2017-09-22    4.7  2GB  iOS 11.0      No
iPhone 8 Plus  2017-09-22    5.5  3GB  iOS 11.0      No
iPhone X       2017-11-03    5.8  3GB  iOS 11.1     Yes
iPhone XS      2018-09-21    5.8  4GB  iOS 12.0     Yes
iPhone XS Max  2018-09-21    6.5  4GB  iOS 12.0     Yes

In [16]:
type(iphone_df)

pandas.core.frame.DataFrame